FradSer/open-deskos/research/esp32-p4-c6-deskos/firmware/application/open_deskos/boards/m5stack/m5papercolor/sdkconfig.defaults.board
# M5Stack PaperColor (ESP32-S3) board defaults.
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ODK_BOARD_M5PAPERCOLOR=y

# Flash / PSRAM
CONFIG_ESPTOOLPY_FLASHMODE_DIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_40M=y

# Custom partition table: 16MB Open DeskOS layout for S3
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions_s3_16MB.csv"

# Console on USB Serial/JTAG
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

# Keep emote disabled to avoid bootloop
# CONFIG_APP_CLAW_ENABLE_EMOTE is not set

# Board-manager peripheral support (mirroring custom dev + periph support)
CONFIG_ESP_BOARD_DEV_CUSTOM_SUPPORT=y
CONFIG_ESP_BOARD_PERIPH_I2C_SUPPORT=y
CONFIG_ESP_BOARD_PERIPH_SPI_SUPPORT=y
CONFIG_ESP_BOARD_PERIPH_LEDC_SUPPORT=y

# FreeRTOS tuning
CONFIG_FREERTOS_TIMER_TASK_STACK_DEPTH=8192
CONFIG_FREERTOS_HZ=1000

# LVGL e-ink tuning: throttle refresh period to 1000ms, disable perf overlay
CONFIG_LV_DEF_REFR_PERIOD=1000
# CONFIG_LV_USE_PERF_MONITOR is not set
# CONFIG_LV_USE_SYSMON is not set
CONFIG_LV_DRAW_BUF_ALIGN=4
CONFIG_LV_USE_PPA=n
CONFIG_LV_USE_PPA_IMG=n
CONFIG_LV_USE_TINY_TTF=y
CONFIG_LV_TINY_TTF_FILE_SUPPORT=y
CONFIG_LV_TINY_TTF_CACHE_GLYPH_CNT=64
CONFIG_LV_TINY_TTF_CACHE_KERNING_CNT=64

# LVGL fonts
CONFIG_LV_FONT_MONTSERRAT_28=y
CONFIG_LV_FONT_DEFAULT_MONTSERRAT_28=y
